const kami = {
    "N": [
        {
            "type": "N",
            "name": "灯笼鬼",
            "avatar": "n_denglonggui",
            "here": ["第1/2/3/5/6/7/9/13/17章", "第九章第一个提灯小僧有三只，建议打完退本再进。"]
        }, {
            "type": "N",
            "name": "提灯小僧",
            "avatar": "n_tidengxiaoseng",
            "here": ["第一章：4个(推荐)","第三章：3个","第七章：3个","第八章：首领桃花妖的小怪2个","第九章：2个","第十二章：2个","第十五章：3个","妖气封印-饿鬼：3个","妖气封印-二口女：4个","妖气封印-海坊主：4个","妖气封印-鬼使黑：3个"]
        }, {
            "type": "N",
            "name": "赤舌",
            "avatar": "n_chishe",
            "here": ["探索副本：","第三章（2个）","赤舌1：1个","赤舌2：1个","第十章（1个）","觉2：1个","第十五章（6个）","天邪鬼绿1：1个","天邪鬼绿2：1个","天邪鬼绿3：1个","提灯小僧1：1个","提灯小僧2：1个","提灯小僧3：1个","第十六章（3个）","小怪1：1个","小怪2：1个","小怪3：1个","想要最快完成任务的话，那就去第15章打,省体力，出的怪多。"]
        }, {
            "type": "N",
            "name": "盗墓小鬼",
            "avatar": "n_daomuxiaogui",
            "here": ["探索副本","第二章","帚神：盗墓小鬼×1 寄生魂×1 帚神×1","小鬼1：盗墓小鬼×1 寄生魂×2","小鬼2：盗墓小鬼×1 灯笼鬼×2","寄生魂2：盗墓小鬼×2 寄生魂×1","第十二章","童女1：童女×1 盗墓小鬼×1 提灯小僧×2;二回合 - 雪女×1","童女2：童女×3 盗墓小鬼×1;二回合 - 雪女×1","第十四章","挑战：盗墓小鬼×14"]
        }, {
            "type": "N",
            "name": "寄生魂",
            "avatar": "n_jishenghun",
            "here": ["第二章（5个）","帚神：帚神x1 寄生魂x1 盗墓小鬼x1","盗墓小鬼1：寄生魂x2 盗墓小鬼x1","寄生魂1：灯笼鬼x2 寄生魂x1","寄生魂2：盗墓小鬼x2 寄生魂x1","第三章（3个）","首领凤凰火：凤凰火x1 寄生魂x3","第五章（2个）","管狐1：管狐x2 天邪鬼黄x2;二回合 - 寄生魂x1","管狐2：管狐x1 天邪鬼绿x3;二回合 - 寄生魂x1","第七章（1个）","首领妖狐：妖狐x1 涂壁x1 座敷童子x2;二回合 - 妖狐x1 寄生魂x1 天邪鬼赤x2","第十一章（3个）","武士之灵1：武士之灵x1 寄生魂x3","第十二章（1个）","首领雪女：雪女x1 寄生魂x1 武士之灵x2;二回合 - 雪女x1 跳跳妹妹x1 跳跳哥哥x2","第十六章（9个）","赤舌1：赤舌x1 寄生魂x3","赤舌2：赤舌x1 寄生魂x3","赤舌3：赤舌x1 寄生魂x3;二回合 - 赤舌x1"]
        }, {
            "type": "N",
            "name": "唐纸伞妖",
            "avatar": "n_tangzhisanyao",
            "here": ["第四章、第八章、第十三章都有唐纸伞妖。", "探索副本第四章桥上的雨女困难模式，其中一个帚神带有三只唐纸伞妖","第八章刷式神挑战"]
        }, {
            "type": "N",
            "name": "天邪鬼绿",
            "avatar": "n_tianxieguilv",
            "here": ["探索副本第五章，一只管狐带了三只天邪鬼绿。","第六章首领带有三只。","第一章刷式神挑战","跳跳哥哥x4","椒图x8","骨女x6","饿鬼x6"]
        }, {
            "type": "N",
            "name": "天邪鬼赤",
            "avatar": "n_tianxieguichi",
            "here": ["探索副本第四章，一只唐纸伞妖带了三只天邪鬼赤。","探索副本第五章，一只涂壁带了三只天邪鬼赤。","探索副本第十三章，饿鬼都带了三只天邪鬼赤。","探索副本第十四章，帚神都带了三只天邪鬼赤。","第七章刷式神挑战。"]
        }, {
            "type": "N",
            "name": "天邪鬼黄",
            "avatar": "n_tianxieguihuang",
            "here": ["探索副本第3章很多，但都只有一只。", "第五章，睡觉的帚神带2个天邪鬼黄","第八章的天邪鬼绿带有两只天邪鬼黄。","妖气封印海坊主副本带有三只","第三章刷式神挑战","海坊主x3"]
        }, {
            "type": "N",
            "name": "天邪鬼青",
            "avatar": "n_tianxieguiqing",
            "here": ["妖气封印二口女有3只，强烈推荐。","探索第2章、第5章、第11章都是BOSS才有，不建议刷。","探索第6章，天邪鬼青点进去有1只，一共2只。","探索第8章，天邪鬼绿点进去有1只，一共2只。","探索第10章，丑时之女可以刷到2只，一共4只。","御魂副本第一层，有1只。"]
        }, {
            "type": "N",
            "name": "帚神",
            "avatar": "n_zhoushen",
            "here": ["骨女妖气封印副本有四个帚神。","第六章探索副本里，灯笼怪带有三只帚神。","第七章探索副本里，有一只鲤鱼精带有三只帚神，另外一个只带了一只帚神。","第九章探索副本里，一只铁鼠带三只帚神，另外一只铁鼠带两只。小编建议等级到的了话在这刷。","如果有式神挑战券的话，可以直接去第五章刷式神挑战。一次即可刷到十几只哦。"]
        }, {
            "type": "N",
            "name": "涂壁",
            "avatar": "n_tubi",
            "here": ["十四章，3个涂壁，每个6只","各章小怪，第四章里较多"]
        }, {
            "type": "N",
            "name": "黑豹",
            "avatar": "n_heibao",
            "here": ["第五章（普通），第一个涂壁，就这一只，全部本唯一一个，就这里有"]
        }, {
            "type": "N",
            "name": "跳跳犬",
            "avatar": "n_tiaotiaoquan",
            "here": ["建议大家在探索副本第七章刷，其中一只河童带有两只，一个提灯小僧带三只，另外一个带一只", "玩家也可以在十五章首领跳跳妹妹处刷到跳跳犬，而且控制的好的话可以让跳跳妹妹一直召唤跳跳犬，也就是说可以无限刷，一下子把任务做完。"]
        }
    ],
    "R": [
        {
            "type": "R",
            "name": "九命猫",
            "avatar": "r_jiuminmao",
            "here": ["九命猫在游戏中的探索副本第一章、第十五章会出现，第一章仅有BOSS处三只而第十五章在途中会出现非常多，等级高的还是刷第十五章比较效率。","第一章刷式神挑战"]
        }, {
            "type": "R",
            "name": "鸦天狗",
            "avatar": "r_yatiangou",
            "here": ["1、第3、9、12、17、18章","2、御魂6层","想要最快完成任务的话，那就去第12章打，海坊主和童男1次出2只。"]
        }, {
            "type": "R",
            "name": "鲤鱼精",
            "avatar": "r_liyujing",
            "here": ["第七章","鲤鱼精1 x3,鲤鱼精2 x1,河童1 x1,提灯小僧3 x2","御魂第二层、三层、九层"]
        }, {
            "type": "R",
            "name": "椒图",
            "avatar": "r_jiaotu",
            "here": ["妖气封印：椒图妖气封印副本","御魂副本第三层第二回合、御魂副本第八层第二回合"]
        }, {
            "type": "R",
            "name": "铁鼠",
            "avatar": "r_tieshu",
            "here": ["妖气封印-金币妖怪","第九章","第三章刷式神挑战"]
        }, {
            "type": "R",
            "name": "首无",
            "avatar": "r_shouwu",
            "here": ["第十三章","2个小怪第二回合都有2只，boss还有2只"]
        }, {
            "type": "R",
            "name": "食发鬼",
            "avatar": "r_shifagui",
            "here": ["第五章bossx1","第十章bossx2","御魂7"]
        }, {
            "type": "R",
            "name": "山兔",
            "avatar": "r_shantu",
            "here": ["探索副本第九章，两只山兔的队伍中一共有七个山兔怪。"]
        }, {
            "type": "R",
            "name": "青蛙瓷器",
            "avatar": "r_qingwaciqi",
            "here": ["第4章首领","御魂3层","推荐御魂3层"]
        }, {
            "type": "R",
            "name": "莹草",
            "avatar": "r_yingcao",
            "here": ["第十七章挑战、结界突破（推荐）、找玩家斗技也可以，御魂第二层、御魂第九层1只、御魂第十层1只、业原火副本贪之阵、痴之阵、嗔之阵。"]
        }, {
            "type": "R",
            "name": "跳跳妹妹",
            "avatar": "r_tiaotiaomeimei",
            "here": ["第12章boss（可以利用跳跳哥哥的棺材复活跳跳妹妹，多次击杀）", "十五章挑战"]
        }, {
            "type": "R",
            "name": "管狐",
            "avatar": "r_guanhu",
            "here": ["探索副本第5章，两个管狐点进去一共有3只。","探索副本第7章也有，但是都在第二回合，不建议刷。","探索副本第11章，独眼小僧、饿鬼点进去也有管狐，一共4只。","第四章挑战"]
        }, {
            "type": "R",
            "name": "独眼小僧",
            "avatar": "r_duyanxiaoseng",
            "here": ["第十一章(7个)，武士之灵2（三个）", "御魂1，御魂5", "第十八章挑战"]
        }, {
            "type": "R",
            "name": "三尾狐",
            "avatar": "r_sanweihu",
            "here": ["18章的三尾全都带2只","6章最后2个蝴蝶精第二局各1","御魂1有1只"]
        }, {
            "type": "R",
            "name": "兵俑",
            "avatar": "r_binyong",
            "here": ["3章 兵俑1：兵俑x1 兵俑2：兵俑x1", "10章 首领：二回合 兵俑x1","13章 挑战：兵俑 兵俑x14,", "4，御魂2层 二回合：兵俑x1"]
        }, {
            "type": "R",
            "name": "座敷童子",
            "avatar": "r_zuofutongzi",
            "here": ["第十章的一个觉和一个傀儡师各带两只座敷童子","第七章首领的带有两只","第二章boss","第二章式神挑战","御魂第三层第三回合有两只","御魂第六层第一回合有一只"]
        }, {
            "type": "R",
            "name": "山童",
            "avatar": "r_shantong",
            "here": ["第十六章的探索副本里，每一只饿鬼都带有两只山童", "御魂副本第一层刷，第二回合会有一只山童","十六章挑战"]
        }, {
            "type": "R",
            "name": "狸猫",
            "avatar": "r_limao",
            "here": ["第十七章","妖刀之秘籍副本第10层到第4层第二回合均有狸猫*3","妖刀之秘籍副本第3层到第1层第二回合均有狸猫*4","红叶的羁绊第七层第3回合有狸猫*1","十四章刷式神挑战"]
        }, {
            "type": "R",
            "name": "河童",
            "avatar": "r_hetong",
            "here": ["第7章","御魂2层"]
        }, {
            "type": "R",
            "name": "童男",
            "avatar": "r_tongnan",
            "here": ["探索副本第十二章", "御魂副本第四层", "妖刀之秘籍副本第9层第三回合，童男*2","第十二章刷式神挑战"]
        }, {
            "type": "R",
            "name": "童女",
            "avatar": "r_tongnv",
            "here": ["第三章 天邪鬼黄2(3个) 赤舌2(2个) 兵俑1", "第十一章boss", "第十二章 童女1(1) 童女2(3) 童男2(1)", "御魂副本2(2)、4" ,"第十二章挑战"]
        }, {
            "type": "R",
            "name": "饿鬼",
            "avatar": "r_egui",
            "here": ["第九章首领带有三只","第十一章有四只，其中靠下方的坐着的饿鬼里边有3只", "第十六章有三只，每次只能打一只，不推荐", "妖气封印饿鬼副本的第三回合有三只", "第十一章刷式神挑战"]
        }, {
            "type": "R",
            "name": "武士之灵",
            "avatar": "r_wushizhiling",
            "here": ["第十一章，有两只武士之灵敌人", "第十二章首领带有两只", "第十章刷式神挑战"]
        }, {
            "type": "R",
            "name": "雨女",
            "avatar": "r_yunv",
            "here": ["第4章boss", "御魂6层"]
        }, {
            "type": "R",
            "name": "跳跳弟弟",
            "avatar": "r_tiaotiaodidi",
            "here": ["跳跳弟弟就很尴尬了，到目前为止还没有其他副本会刷出来，但是玩家可以在妖怪封印中的跳跳一家中遇到他"]
        }, {
            "type": "R",
            "name": "巫蛊师",
            "avatar": "r_wugushi",
            "here": ["探索副本第六章的首领", "御魂副本的第六层", "第六章刷式神挑战"]
        }, {
            "type": "R",
            "name": "丑时之女",
            "avatar": "r_choushizhinv",
            "here": ["御魂5层", "探索副本第十章", "第十章刷式神挑战"]
        }, {
            "type": "R",
            "name": "蝴蝶精",
            "avatar": "r_hudiejing",
            "here": ["第六章", "第八章Boss", "御魂副本3、8", "第六章挑战"]
        }, {
            "type": "R",
            "name": "觉",
            "avatar": "r_jue",
            "here": ["第10、11章", "御魂10层"]
        }
    ],
    "SR": [
        {
            "type": "SR",
            "name": "青坊主",
            "avatar": "sr_qingfangzhu",
            "here": ["未知"]
        }, {
            "type": "SR",
            "name": "般若",
            "avatar": "sr_banruo",
            "here": ["未知"]
        }, {
            "type": "SR",
            "name": "鬼女红叶",
            "avatar": "sr_guinvhongye",
            "here": ["第11章首领"]
        }, {
            "type": "SR",
            "name": "惠比寿",
            "avatar": "sr_huibishou",
            "here": ["未知"]
        }, {
            "type": "SR",
            "name": "镰鼬",
            "avatar": "sr_lianyou",
            "here": ["御魂5层", "第十八章挑战", "结界突破/斗技"]
        }, {
            "type": "SR",
            "name": "犬神",
            "avatar": "sr_quanshen",
            "here": ["第10章", "御魂4层"]
        }, {
            "type": "SR",
            "name": "姑获鸟",
            "avatar": "sr_guhuoniao",
            "here": ["斗鸡突破"]
        }, {
            "type": "SR",
            "name": "妖琴师",
            "avatar": "sr_yaoqinshi",
            "here": ["御魂7层"]
        }, {
            "type": "SR",
            "name": "鬼使黑",
            "avatar": "sr_guishihei",
            "here": ["第十六章BOSS：共1个","御魂四层：共1个","妖气封印：共3个"]
        }, {
            "type": "SR",
            "name": "鬼使白",
            "avatar": "sr_guishibai",
            "here": ["第16章","御魂4层"]
        }, {
            "type": "SR",
            "name": "络新妇",
            "avatar": "sr_luoxinfu",
            "here": ["未知"]
        }, {
            "type": "SR",
            "name": "雪女",
            "avatar": "sr_xuenv",
            "here": ["第八章，樱花妖的第二回合会有一只雪女", "第十二章：共2个(二回合),BOSS：共2个"]
        }, {
            "type": "SR",
            "name": "白狼",
            "avatar": "sr_bailang",
            "here": ["御魂8层 二回合1个", "斗技和结界突破均能看到"]
        }, {
            "type": "SR",
            "name": "吸血姬",
            "avatar": "sr_xixueji",
            "here": ["御魂2层"]
        }, {
            "type": "SR",
            "name": "妖狐",
            "avatar": "sr_yaohu",
            "here": ["第7章首领有2只", "御魂2层"]
        }, {
            "type": "SR",
            "name": "桃花妖",
            "avatar": "sr_taohuayao",
            "here": ["第八章boss", "御魂副本3"]
        }, {
            "type": "SR",
            "name": "海坊主",
            "avatar": "sr_haifangzhu",
            "here": ["第12章", "妖气封印", "御魂3层"]
        }, {
            "type": "SR",
            "name": "食梦貘",
            "avatar": "sr_shimengmo",
            "here": ["第14章涂壁3，首领有4只", "御魂4层有2只，御魂9层1只"]
        }, {
            "type": "SR",
            "name": "傀儡师",
            "avatar": "sr_kuileishi",
            "here": ["第10章", "御魂5层"]
        }, {
            "type": "SR",
            "name": "孟婆",
            "avatar": "sr_mengpo",
            "here": ["第9章", "御魂5层(2)、6层"]
        }, {
            "type": "SR",
            "name": "樱花妖",
            "avatar": "sr_yinghuayao",
            "here": ["第8章"]
        }, {
            "type": "SR",
            "name": "判官",
            "avatar": "sr_panguan",
            "here": ["第16章首领", "御魂8层"]
        }, {
            "type": "SR",
            "name": "骨女",
            "avatar": "sr_gunv",
            "here": ["第10/11/13/17章", "御魂5层/6层(2)"]
        }, {
            "type": "SR",
            "name": "跳跳哥哥",
            "avatar": "sr_tiaotiaogege",
            "here": ["第10、12章", "御魂5层、10层", "妖气封印"]
        }, {
            "type": "SR",
            "name": "清姬",
            "avatar": "sr_qingji",
            "here": ["御魂9层 二回合 1个"]
        }, {
            "type": "SR",
            "name": "二口女",
            "avatar": "sr_erkounv",
            "here": ["御魂10层", "妖气封印"]
        }, {
            "type": "SR",
            "name": "凤凰火",
            "avatar": "sr_fenghuanghuo",
            "here": ["第3章", "御魂7层"]
        }
    ],
    "SSR": [
        {
            "type": "SSR",
            "name": "一目连",
            "avatar": "ssr_yimulian",
            "here": []
        }, {
            "type": "SSR",
            "name": "大天狗",
            "avatar": "ssr_datiangou",
            "here": ["【第十五章】最后一个提灯小僧带1个;", "【第十八章】第一个三尾狐带1个，BOSS大天狗带1个;", "【御魂】第四层带1个，第十层带2个;", "【结界突破/斗技 推荐】很多欧洲玩家都带大天狗;", "【妖刀之秘籍】第八到十层各带1个；"]
        }, {
            "type": "SSR",
            "name": "阎魔",
            "avatar": "ssr_yanmo",
            "here": ["御魂6层"]
        }, {
            "type": "SSR",
            "name": "青行灯",
            "avatar": "ssr_qingxingdeng",
            "here": []
        }, {
            "type": "SSR",
            "name": "两面佛",
            "avatar": "ssr_liangmianfo",
            "here": []
        }, {
            "type": "SSR",
            "name": "酒吞童子",
            "avatar": "ssr_jiutuntongzi",
            "here": ["探索副本第十章首领酒吞童子有2个", "御魂副本7/10"]
        }, {
            "type": "SSR",
            "name": "荒川之主",
            "avatar": "ssr_huangchuanzhizhu",
            "here": ["第十七章、御魂7(2)"]
        }, {
            "type": "SSR",
            "name": "茨木童子",
            "avatar": "ssr_cimutongzi",
            "here": []
        }, {
            "type": "SSR",
            "name": "妖刀姬",
            "avatar": "ssr_yaodaoji",
            "here": []
        }, {
            "type": "SSR",
            "name": "小鹿男",
            "avatar": "ssr_xiaolunan",
            "here": []
        }
    ]
}

//匹配
let kamiMap = {};
for (let i in kami) {
    kami[i].forEach((item, index) => {
        kamiMap[item.name] = item;
    });
}

let shenmi = {
    "大翅膀/风/羽毛/笛子/扇":kamiMap["大天狗"],
    "云/鬼面/冥界":kamiMap["阎魔"],
    "锤/钉耙/剑":kamiMap["镰鼬"],
    "铃铛/噩梦":kamiMap["食梦貘"],
    "汤碗/琴，牙牙":kamiMap["孟婆"],
    "人偶/模拟":kamiMap["傀儡师"],
    "海/胡须/杖":kamiMap["海坊主"],
    "黑镰/短刀":kamiMap["鬼使黑"],
    "冥界/白/夺命":kamiMap["鬼使白"],
    "骷髅/怨恨/剑":kamiMap["骨女"],
    "剑/雀/屋，柴犬，守护":kamiMap["犬神"],
    "血/蝙蝠":kamiMap["吸血姬"],
    "纸扇/书生，面具":kamiMap["妖狐"],
    "花/舞":kamiMap["桃花妖"],
    "蜡烛/棺材":kamiMap["跳跳哥哥"],
    "稻草人/咒锥":kamiMap["丑时之女"],
    "剑/坚甲，石化":kamiMap["兵俑"],
    "鬼火/角，财富/幸运":kamiMap["座敷童子"],
    "泪珠/雨/伞":kamiMap["雨女"],
    "蛊/迷魂":kamiMap["巫蛊师"],
    "翅膀/羽衣/幼女":kamiMap["童女"],
    "手鼓/小妖精":kamiMap["蝴蝶精"],
    "扇子/水/贝壳/尾巴":kamiMap["椒图"],
    "水池/水泡/尾巴":kamiMap["鲤鱼精"],
    "翅膀/羽衣/献祭":kamiMap["童男"],
    "蒲公英/治愈/叮~":kamiMap["莹草"],
    "单眼/石菩萨/金刚经":kamiMap["独眼小僧"],
    "妖艳/红尾/樱花树/红色":kamiMap["三尾狐"],
    "二筒/瓷/出千":kamiMap["青蛙瓷器"],
    "单眼/石锤/怪力":kamiMap["山童"],
    "薙刀/翅膀，面具":kamiMap["鸦天狗"],
    "水球/河流/荷叶":kamiMap["河童"],
    "鼓/单眼":kamiMap["天邪鬼黄"],
    "风筝/青皮肤":kamiMap["天邪鬼青"],
    "红鬼/打屁股":kamiMap["天邪鬼赤"],
    "墙/石/青苔":kamiMap["涂壁"]
}

export {kami};
export {shenmi};